app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `role` = 'wali_kelas'
---
    public function kelas()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $kelasModel = new \App\Models\Kelas();
        $data['kelas'] = $kelasModel->getKelasWithWalikelas();

        // Mendapatkan semua user dengan role wali_kelas untuk dropdown
        $userModel = new User();
        $data['walikelas'] = $userModel->where('role', 'wali_kelas')->findAll();

SELECT `user_id`
FROM `absensi`
WHERE DATE(waktu_presensi) = '2025-09-08'
GROUP BY `user_id`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'siswa'
---
    public function dashboard()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        // Get today's attendance data - hanya menghitung jumlah user yang presensi hari ini
        $absensiModel = new Absensi();
        $today = date('Y-m-d');

        // Dapatkan presensi hari ini yang dikelompokkan per user
        $hadirData = $absensiModel->select('user_id')
            ->where('DATE(waktu_presensi)', $today)
            ->groupBy('user_id')
            ->findAll();

        $data['hadir'] = count($hadirData);

        // Get total students
        $userModel = new User();
        $data['total_siswa'] = $userModel->where('role', 'siswa')->countAllResults();

SELECT *
FROM `pengaturan`
 LIMIT 1
---
    public function pengaturanPresensi()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $pengaturanModel = new Pengaturan();
        $data['pengaturan'] = $pengaturanModel->first();

SELECT *
FROM `pengaturan`
 LIMIT 1
UPDATE `pengaturan` SET `jam_masuk_senin` = '', `jam_pulang_senin` = '', `jam_masuk_selasa` = '', `jam_pulang_selasa` = '', `jam_masuk_rabu` = '', `jam_pulang_rabu` = '', `jam_masuk_kamis` = '', `jam_pulang_kamis` = '', `jam_masuk_jumat` = '', `jam_pulang_jumat` = '', `jam_masuk_sabtu` = '', `jam_pulang_sabtu` = '', `jam_masuk_minggu` = '07:00', `jam_pulang_minggu` = '16:00'
WHERE `pengaturan`.`id` IN ('1')
---
    public function simpanJamPresensi()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $pengaturanModel = new Pengaturan();
        $pengaturan = $pengaturanModel->first();

        $data = [];
        // Tambahkan hari Sabtu dan Minggu
        $hariNames = ['senin', 'selasa', 'rabu', 'kamis', 'jumat', 'sabtu', 'minggu'];

        foreach ($hariNames as $hari) {
            $data['jam_masuk_' . $hari] = $this->request->getPost('jam_masuk_' . $hari);
            $data['jam_pulang_' . $hari] = $this->request->getPost('jam_pulang_' . $hari);
        }

        try {
            if ($pengaturan) {
                // Update existing setting
                if ($pengaturanModel->update($pengaturan['id'], $data)) {

SELECT *
FROM `kelas`
---
    public function inputPresensiHarian()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $kelasModel = new \App\Models\Kelas();
        $userModel = new User();
        $absensiManualModel = new \App\Models\AbsensiManual();
        $absensiModel = new \App\Models\Absensi(); // Main attendance model

        // Get filter parameters from request
        $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');
        $tingkat = $this->request->getGet('tingkat');
        $jurusan = $this->request->getGet('jurusan');
        $page = $this->request->getGet('page') ?? 1;
        $perPage = 20;

        $data['kelas'] = $kelasModel->findAll();

SELECT DISTINCT `user_id`
FROM `absensi`
WHERE DATE(waktu_presensi) = '2025-09-08'
---
        // Only process if at least one filter is provided
        if (!empty($tingkat) || !empty($jurusan)) {
            // Get student IDs who have already done main attendance
            $attendedUserIdsMain = $absensiModel->where('DATE(waktu_presensi)', $tanggal)
                                               ->distinct()
                                               ->findColumn('user_id') ?? [];