app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = '199304072022211004'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Validate input
        if (empty($username) || empty($password)) {
            return redirect()->back()->with('error', 'Username dan password harus diisi');
        }

        try {
            $userModel = new User();
            $user = $userModel->where('username', $username)->first();