app/Controllers/IzinKeluarController.php

    public function show($id = null)
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        $model = new IzinKeluar();
        $data['izin'] = $model
            ->select('izin_keluar.*, siswa.nama_lengkap as nama_siswa, gk.nama_lengkap as nama_guru_kelas, wk.nama_lengkap as nama_wali_kelas, wku.nama_lengkap as nama_wakil_kurikulum, gp.nama_lengkap as nama_guru_piket, p.nama_lengkap as nama_penolak')
            ->join('users as siswa', 'siswa.id = izin_keluar.siswa_id', 'left')
            ->join('users as gk', 'gk.id = izin_keluar.guru_kelas_id', 'left')
            ->join('users as wk', 'wk.id = izin_keluar.wali_kelas_id', 'left')
            ->join('users as wku', 'wku.id = izin_keluar.wakil_kurikulum_id', 'left')
            ->join('users as gp', 'gp.id = izin_keluar.guru_piket_id', 'left')
            ->join('users as p', 'p.id = izin_keluar.penolak_id', 'left')
            ->find($id);

        if (!$data['izin']) {
            return $this->failNotFound('Permintaan izin tidak ditemukan');
        }

        // Add authorization check later if needed

        $bersamaModel = new IzinKeluarBersama();
        $data['bersama'] = $bersamaModel
            ->select('users.nama_lengkap')
            ->join('users', 'users.id = izin_keluar_bersama.siswa_id')
            ->where('izin_keluar_id', $id)
            ->findAll();
---
SELECT `users`.`nama_lengkap`
FROM `izin_keluar_bersama`
JOIN `users` ON `users`.`id` = `izin_keluar_bersama`.`siswa_id`
WHERE `izin_keluar_id` = '10'