app/Controllers/IzinKeluarController.php

    public function show($id = null)
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        $model = new IzinKeluar();
        $data['izin'] = $model
            ->select('izin_keluar.*, siswa.nama_lengkap as nama_siswa, gk.nama_lengkap as nama_guru_kelas, wk.nama_lengkap as nama_wali_kelas, wku.nama_lengkap as nama_wakil_kurikulum, gp.nama_lengkap as nama_guru_piket, p.nama_lengkap as nama_penolak')
            ->join('users as siswa', 'siswa.id = izin_keluar.siswa_id', 'left')
            ->join('users as gk', 'gk.id = izin_keluar.guru_kelas_id', 'left')
            ->join('users as wk', 'wk.id = izin_keluar.wali_kelas_id', 'left')
            ->join('users as wku', 'wku.id = izin_keluar.wakil_kurikulum_id', 'left')
            ->join('users as gp', 'gp.id = izin_keluar.guru_piket_id', 'left')
            ->join('users as p', 'p.id = izin_keluar.penolak_id', 'left')
            ->find($id);
---
SELECT `izin_keluar`.*, `siswa`.`nama_lengkap` as `nama_siswa`, `gk`.`nama_lengkap` as `nama_guru_kelas`, `wk`.`nama_lengkap` as `nama_wali_kelas`, `wku`.`nama_lengkap` as `nama_wakil_kurikulum`, `gp`.`nama_lengkap` as `nama_guru_piket`, `p`.`nama_lengkap` as `nama_penolak`
FROM `izin_keluar`
LEFT JOIN `users` as `siswa` ON `siswa`.`id` = `izin_keluar`.`siswa_id`
LEFT JOIN `users` as `gk` ON `gk`.`id` = `izin_keluar`.`guru_kelas_id`
LEFT JOIN `users` as `wk` ON `wk`.`id` = `izin_keluar`.`wali_kelas_id`
LEFT JOIN `users` as `wku` ON `wku`.`id` = `izin_keluar`.`wakil_kurikulum_id`
LEFT JOIN `users` as `gp` ON `gp`.`id` = `izin_keluar`.`guru_piket_id`
LEFT JOIN `users` as `p` ON `p`.`id` = `izin_keluar`.`penolak_id`
WHERE `izin_keluar`.`id` = '7'

        // Add authorization check later if needed

        $bersamaModel = new IzinKeluarBersama();
        $data['bersama'] = $bersamaModel
            ->select('users.nama_lengkap')
            ->join('users', 'users.id = izin_keluar_bersama.siswa_id')
            ->where('izin_keluar_id', $id)
            ->findAll();
---
SELECT `users`.`nama_lengkap`
FROM `izin_keluar_bersama`
JOIN `users` ON `users`.`id` = `izin_keluar_bersama`.`siswa_id`
WHERE `izin_keluar_id` = '7'

    public function create()
    {
        if (!$this->session->get('isLoggedIn') || $this->session->get('role') !== 'siswa') {
            return redirect()->to('/auth');
        }

        $model = new IzinKeluar();

        $data = [
            'siswa_id'   => $this->session->get('user_id'),
            'jenis_izin' => $this->request->getVar('jenis_izin'),
            'alasan'     => $this->request->getVar('alasan'),
            'jam_keluar' => null, // Jam keluar akan diisi oleh admin
            'jam_kembali' => null,
            'status'     => 'diajukan' // Initial status
        ];

        // Add validation
        $validation = \Config\Services::validation();
        $validation->setRules([
            'jenis_izin' => 'required',
            'alasan' => 'required|min_length[5]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('error', implode(', ', $validation->getErrors()));
        }

        $izinId = $model->insert($data);
---
INSERT INTO `izin_keluar` (`siswa_id`, `jenis_izin`, `alasan`, `jam_keluar`, `jam_kembali`, `status`, `created_at`, `updated_at`) VALUES ('2', 'lainnya', 'sdsdsdsds', NULL, NULL, 'diajukan', '2025-09-09 22:38:33', '2025-09-09 22:38:33')

    public function assignForm($id = null)
    {
        if (!$this->session->get('isLoggedIn') || $this->session->get('role') !== 'admin') {
            return $this->failForbidden('You are not allowed to perform this action.');
        }

        $izinModel = new IzinKeluar();
        $userRoleModel = new \App\Models\UserRole();
        $userModel = new User(); // Load the User model

        $data['izin'] = $izinModel
            ->select('izin_keluar.*, users.nama_lengkap as nama_siswa')
            ->join('users', 'users.id = izin_keluar.siswa_id')
            ->find($id);

        if (!$data['izin']) {
            return $this->failNotFound('Permintaan izin tidak ditemukan.');
        }

        // Izinkan akses selama status belum 'disetujui' atau 'ditolak'
        if ($data['izin']['status'] === 'disetujui' || $data['izin']['status'] === 'ditolak') {
            return $this->failNotFound('Permintaan izin tidak dapat ditugaskan ulang karena sudah selesai atau ditolak.');
        }

        // Get user lists
        $data['guru_mapel_list'] = $userModel->where('role', 'guru')->findAll(); // All users with main role 'guru'
---
SELECT `izin_keluar`.*, `users`.`nama_lengkap` as `nama_siswa`
FROM `izin_keluar`
JOIN `users` ON `users`.`id` = `izin_keluar`.`siswa_id`
WHERE `izin_keluar`.`id` = '7'
SELECT *
FROM `users`
WHERE `role` = 'guru'