app/Controllers/IzinKeluarController.php

    public function show($id = null)
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        $model = new IzinKeluar();
        $data['izin'] = $model
            ->select('izin_keluar.*, siswa.nama_lengkap as nama_siswa, gk.nama_lengkap as nama_guru_kelas, wk.nama_lengkap as nama_wali_kelas, wku.nama_lengkap as nama_wakil_kurikulum, gp.nama_lengkap as nama_guru_piket, p.nama_lengkap as nama_penolak')
            ->join('users as siswa', 'siswa.id = izin_keluar.siswa_id', 'left')
            ->join('users as gk', 'gk.id = izin_keluar.guru_kelas_id', 'left')
            ->join('users as wk', 'wk.id = izin_keluar.wali_kelas_id', 'left')
            ->join('users as wku', 'wku.id = izin_keluar.wakil_kurikulum_id', 'left')
            ->join('users as gp', 'gp.id = izin_keluar.guru_piket_id', 'left')
            ->join('users as p', 'p.id = izin_keluar.penolak_id', 'left')
            ->find($id);
---
SELECT `izin_keluar`.*, `siswa`.`nama_lengkap` as `nama_siswa`, `gp`.`nama_lengkap` as `nama_guru_piket`
FROM `izin_keluar`
LEFT JOIN `users` as `siswa` ON `siswa`.`id` = `izin_keluar`.`siswa_id`
LEFT JOIN `users` as `gp` ON `gp`.`id` = `izin_keluar`.`guru_piket_id`
WHERE `siswa_id` = '2'

    public function new()
    {
        if (!$this->session->get('isLoggedIn') || $this->session->get('role') !== 'siswa') {
            return redirect()->to('/auth');
        }

        $userModel = new User();
        // Get other students for the 'accompanying friends' feature
        $data['students'] = $userModel->where('role', 'siswa')->where('id !=', $this->session->get('user_id'))->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'siswa'
AND `id` != '6'