app/Controllers/KelasController.php

    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $kelasModel = new Kelas();

        // Fetch classes with wali_kelas information using the new column
        $kelas = $kelasModel->select('kelas.*, users.nama_lengkap as nama_walikelas, users.username as nip_walikelas')
                                    ->join('users', 'users.id = kelas.wali_kelas_user_id', 'left')
                                    ->paginate(10, 'kelas'); // Use paginate() and define a group name
---
SELECT COUNT(*) AS `numrows`
FROM `kelas`
LEFT JOIN `users` ON `users`.`id` = `kelas`.`wali_kelas_user_id`
SELECT `kelas`.*, `users`.`nama_lengkap` as `nama_walikelas`, `users`.`username` as `nip_walikelas`
FROM `kelas`
LEFT JOIN `users` ON `users`.`id` = `kelas`.`wali_kelas_user_id`
 LIMIT 10