app/Controllers/LaporanController.php

    public function index()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $kelasModel = new Kelas();
        $data['kelas'] = $kelasModel->findAll();
---
SELECT *
FROM `kelas`