app/Controllers/LiburNasionalController.php

    public function index()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $liburNasionalModel = new LiburNasional();
        $liburNasionalModelBuilder = $liburNasionalModel->orderBy('tahun', 'DESC')->orderBy('tanggal', 'ASC');
        $data['libur_nasional'] = $liburNasionalModelBuilder->paginate(10, 'group3');
---
SELECT *
FROM `libur_nasional`
ORDER BY `tahun` DESC, `tanggal` ASC
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `libur_nasional`