app/Controllers/Siswa.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DATE(waktu_presensi) as tanggal
FROM `absensi`
WHERE `user_id` = '2'
GROUP BY DATE(waktu_presensi)
) CI_count_all_results
---
    public function dashboard()
    {
        // Check if user is logged in and is a student or has student-like role
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        // Cek apakah user memiliki role siswa atau role yang diizinkan mengakses halaman siswa
        $allowedRoles = ['siswa'];
        $userRole = $session->get('role');

        // Jika menggunakan sistem multiple roles, cek roles tambahan
        $userModel = new User();
        $allRoles = $userModel->getAllUserRoles($session->get('user_id'));

        $hasAccess = in_array($userRole, $allowedRoles) || count(array_intersect($allRoles, $allowedRoles)) > 0;

        if (!$hasAccess) {
            return redirect()->to('/auth');
        }

        $userId = $session->get('user_id');
        $data['user'] = $userModel->find($userId);

        // Hitung rekap kehadiran - hanya perlu menghitung jumlah hari dengan presensi
        $absensiModel = new Absensi();
        $today = date('Y-m-d');

        // Hitung total hari masuk (presensi)
        $totalHariMasuk = $absensiModel->select('DATE(waktu_presensi) as tanggal')
            ->where('user_id', $userId)
            ->groupBy('DATE(waktu_presensi)')
            ->countAllResults();

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `absensi`
WHERE `user_id` = '2'
AND DATE(waktu_presensi) = '2025-09-07'
 LIMIT 1
---
    public function presensi()
    {
        // Check if user is logged in and is a student or has student-like role
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        // Cek apakah user memiliki role siswa atau role yang diizinkan mengakses halaman siswa
        $allowedRoles = ['siswa'];
        $userRole = $session->get('role');

        // Jika menggunakan sistem multiple roles, cek roles tambahan
        $userModel = new User();
        $allRoles = $userModel->getAllUserRoles($session->get('user_id'));

        $hasAccess = in_array($userRole, $allowedRoles) || count(array_intersect($allRoles, $allowedRoles)) > 0;

        if (!$hasAccess) {
            return redirect()->to('/auth');
        }

        $userId = $session->get('user_id');
        $data['user'] = $userModel->find($userId);

        // Get today's attendance status - hanya perlu satu presensi per hari
        $absensiModel = new Absensi();
        $today = date('Y-m-d');
        $data['presensi'] = $absensiModel->where('user_id', $userId)
            ->where('DATE(waktu_presensi)', $today)
            ->first();

SELECT *
FROM `absensi`
WHERE `user_id` = '2'
AND DATE(waktu_presensi) = '2025-09-06'
 LIMIT 1
---
            // Cek apakah user sudah presensi hari ini
            $absensiModel = new Absensi();
            $today = date('Y-m-d');
            $existingPresensi = $absensiModel->where('user_id', $userId)
                ->where('DATE(waktu_presensi)', $today)
                ->first();

SELECT *
FROM `pengaturan`
 LIMIT 1
---

            // Validate location
            $pengaturanModel = new Pengaturan();
            $pengaturan = $pengaturanModel->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---

            // Face recognition validation
            $userModel = new User();
            $user = $userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function profile()
    {
        // Check if user is logged in and is a student or has student-like role
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        // Cek apakah user memiliki role siswa atau role yang diizinkan mengakses halaman siswa
        $allowedRoles = ['siswa'];
        $userRole = $session->get('role');

        // Jika menggunakan sistem multiple roles, cek roles tambahan
        $userModel = new User();
        $allRoles = $userModel->getAllUserRoles($session->get('user_id'));

        $hasAccess = in_array($userRole, $allowedRoles) || count(array_intersect($allRoles, $allowedRoles)) > 0;

        if (!$hasAccess) {
            return redirect()->to('/auth');
        }

        $userId = $session->get('user_id');
        $userModel = new User();
        $data['user'] = $userModel->find($userId);

SELECT *
FROM `pengaturan`
 LIMIT 1
---
    private function isLateForPresensi($waktuPresensi)
    {
        try {
            // Dapatkan hari dalam seminggu (1 = Senin, 7 = Minggu)
            $hari = date('N', strtotime($waktuPresensi));

            // Hanya cek keterlambatan untuk hari Senin-Jumat (1-5)
            if ($hari < 1 || $hari > 5) {
                return ['status' => 'weekend', 'is_late' => false, 'message' => 'Hari ini bukan hari kerja.'];
            }

            // Dapatkan pengaturan jam presensi
            $pengaturanModel = new Pengaturan();
            $pengaturan = $pengaturanModel->first();