app/Controllers/Siswa.php

SELECT *
FROM `pengaturan`
 LIMIT 1
---
    public function checkLocation()
    {
        // Get JSON data
        $json = $this->request->getJSON();

        if (!$json || !isset($json->latitude) || !isset($json->longitude)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Data lokasi tidak lengkap.']);
        }

        $latitude = $json->latitude;
        $longitude = $json->longitude;

        // Validate numeric values
        if (!is_numeric($latitude) || !is_numeric($longitude)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Koordinat harus berupa angka.']);
        }

        try {
            // Validate location
            $pengaturanModel = new Pengaturan();
            $pengaturan = $pengaturanModel->first();

SELECT DATE(waktu_presensi) as tanggal, MIN(waktu_presensi) as jam_presensi
FROM `absensi`
WHERE `user_id` = '2'
GROUP BY DATE(waktu_presensi)
ORDER BY `tanggal` DESC
---
    public function riwayat()
    {
        // Check if user is logged in and is a student or has student-like role
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        // Cek apakah user memiliki role siswa atau role yang diizinkan mengakses halaman siswa
        $allowedRoles = ['siswa'];
        $userRole = $session->get('role');

        // Jika menggunakan sistem multiple roles, cek roles tambahan
        $userModel = new User();
        $allRoles = $userModel->getAllUserRoles($session->get('user_id'));

        $hasAccess = in_array($userRole, $allowedRoles) || count(array_intersect($allRoles, $allowedRoles)) > 0;

        if (!$hasAccess) {
            return redirect()->to('/auth');
        }

        $userId = $session->get('user_id');
        $absensiModel = new Absensi();
        $absensiManualModel = new \App\Models\AbsensiManual();
        $liburNasionalModel = new \App\Models\LiburNasional();

        // Ambil data presensi yang sudah ada
        $presensiExist = $absensiModel
            ->select('DATE(waktu_presensi) as tanggal, MIN(waktu_presensi) as jam_presensi')
            ->where('user_id', $userId)
            ->groupBy('DATE(waktu_presensi)')
            ->orderBy('tanggal', 'DESC')
            ->findAll();