app/Controllers/UserController.php

            $userModelBuilder = $userModelBuilder->where('id_kelas', $id_kelas);
        }

        $data['users'] = $userModelBuilder->paginate(10, 'group1');
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`

        log_message('debug', 'UserController@index: Users data passed to view: ' . json_encode($data['users']));

        // Mendapatkan data kelas untuk ditampilkan
        $data['kelas'] = $kelasModel->findAll();
---
SELECT *
FROM `kelas`