app/Controllers/UserController.php

SELECT *
FROM `users`
SELECT *
FROM `kelas`
---
    public function index()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/auth');
        }

        $userModel = new User();
        $data['users'] = $userModel->findAll();

        // Mendapatkan data kelas untuk ditampilkan
        $kelasModel = new Kelas();
        $data['kelas'] = $kelasModel->findAll();