app/Models/Kelas.php

SELECT `kelas`.*, `walikelas`.`nama_lengkap` as `nama_walikelas`, `walikelas`.`username` as `nip_walikelas`
FROM `kelas`
LEFT JOIN `users` `walikelas` ON `walikelas`.`id_kelas` = `kelas`.`id` AND `walikelas`.`role` = "wali_kelas"
ORDER BY `kelas`.`tingkat` ASC, `kelas`.`jurusan` ASC, `kelas`.`nama_kelas` ASC
---
    public function getKelasWithWalikelas()
    {
        return $this->select('kelas.*,
                             walikelas.nama_lengkap as nama_walikelas,
                             walikelas.username as nip_walikelas')
            ->join('users walikelas', 'walikelas.id_kelas = kelas.id AND walikelas.role = "wali_kelas"', 'left')
            ->orderBy('kelas.tingkat', 'ASC')
            ->orderBy('kelas.jurusan', 'ASC')
            ->orderBy('kelas.nama_kelas', 'ASC')
            ->findAll();