app/Models/LiburNasional.php

    public function getLiburInRange($startDate, $endDate)
    {
        return $this->where('tanggal >=', $startDate)
                   ->where('tanggal <=', $endDate)
                   ->findAll();
---
SELECT *
FROM `libur_nasional`
WHERE `tanggal` >= '2025-09-01'
AND `tanggal` <= '2025-09-30'