app/Models/UserRole.php

    public function getRoleNamesByUserId($userId)
    {
        $roles = $this->select('role')->where('user_id', $userId)->findAll();
---
SELECT `role`
FROM `user_roles`
WHERE `user_id` = '2'

    public function getUsersByRole($role)
    {
        return $this->select('users.*, user_roles.role')
            ->join('users', 'users.id = user_roles.user_id')
            ->where('user_roles.role', $role)
            ->findAll();
---
SELECT `users`.*, `user_roles`.`role`
FROM `user_roles`
JOIN `users` ON `users`.`id` = `user_roles`.`user_id`
WHERE `user_roles`.`role` = 'wali_kelas'