app/Models/User.php

    public function getAllUserRoles($userId)
    {
        $roles = [$this->select('role')->where('id', $userId)->first()['role']];
---
SELECT `role`
FROM `users`
WHERE `id` = '2'
 LIMIT 1